app/views/ratings/index.html.erb

  <% @ratings.each do |rating| %>
      <li> <%= rating %> <%= link_to User.find(rating.user_id).username, User.find(rating.user_id)  %> </li>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]