app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings"
---
    <td><%= link_to user.username, user %></td>
    <td><%= user.ratings.count%></td>