app/views/styles/show.html.erb

SELECT "beers".* FROM "beers"  WHERE "beers"."style_id" = ?  [["style_id", 2]]
SELECT COUNT(*) FROM "beers"  WHERE "beers"."style_id" = ?  [["style_id", 2]]
---
<p> Number of beers
  <%= @style.beers.count %>

SELECT  1 AS one FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."style_id" = ? LIMIT 1  [["style_id", 2]]
SELECT "ratings".* FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."style_id" = ?  [["style_id", 1]]
---

<% if @style.ratings.empty? %>