app/views/beers/_form.html.erb

SELECT "styles".* FROM "styles"
---
    <%= f.label :style %><br>
    <%= f.select :style, options_for_select(@styles, selected: @beer.style) %>