app/views/beers/show.html.erb


<% if @beer.ratings.empty? %>
---
SELECT  1 AS one FROM "ratings"  WHERE "ratings"."beer_id" = ? LIMIT 1  [["beer_id", 2]]
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."beer_id" = ?  [["beer_id", 2]]