app/controllers/beer_clubs_controller.rb

SELECT "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---
  def show
    if (current_user and @beer_club.members.include?(current_user))
      @membership = current_user.memberships.select{ |membership| membership.beer_club_id == @beer_club.id }.first

DELETE FROM "beer_clubs" WHERE "beer_clubs"."id" = ?  [["id", 1]]
---
  def destroy
    @beer_club.destroy