app/controllers/beers_controller.rb

INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", "2015-02-05 13:21:58.710884"], ["name", "Karhuli"], ["style", "Lager"], ["updated_at", "2015-02-05 13:21:58.710884"]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save