app/controllers/breweries_controller.rb

  def toggle_activity
    brewery = Brewery.find(params[:id])
    brewery.update_attribute :active, (not brewery.active)
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = 1  [["active", "f"], ["updated_at", "2015-02-18 23:38:56.943773"]]