app/controllers/memberships_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def new
    @beer_clubs = BeerClub.all.reject{ |b| b.members.include? current_user }

INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", "2015-02-10 14:28:08.891300"], ["updated_at", "2015-02-10 14:28:08.891300"], ["user_id", 1]]
---
  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user

    respond_to do |format|
      if @membership.save

DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 4]]
---
  def destroy
    @membership.destroy