app/controllers/ratings_controller.rb

  def index
    @ratings = Rating.all
    @top_beers = Beer.first.top 3
    @top_styles = Style.first.top 3
    @top_breweries = Brewery.first.top 3
    @most_active_users = User.first.most_ratings 3
---
SELECT "ratings".* FROM "ratings"
SELECT  "beers".* FROM "beers"   ORDER BY "beers"."id" ASC LIMIT 1
SELECT  "styles".* FROM "styles"   ORDER BY "styles"."id" ASC LIMIT 1
SELECT  "breweries".* FROM "breweries"   ORDER BY "breweries"."id" ASC LIMIT 1
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."beer_id" = ?  [["beer_id", 2]]

  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if @rating.save
---
INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 2], ["created_at", "2015-02-05 13:22:07.716793"], ["score", 11], ["updated_at", "2015-02-05 13:22:07.716793"]]