app/controllers/users_controller.rb

UPDATE "users" SET "account_frozen" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["account_frozen", "t"], ["updated_at", "2015-02-19 15:25:20.340634"]]
---
  def freeze_user
    @user.update_attribute :account_frozen, (not @user.account_frozen)

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save